'''
โปรแกรมช่วยสร้างอัษรเบรลล์ภาษาไทย
==================
พัฒนาโดย นาย วรรณพงษ์  ภัททิยไพบูลย์
เริ่ม 19 มีนาคม 2560

ความสามารถที่ควรมี
- สามารถแปลงข้อความปกติเป็นอักษรเบรลล์ได้
- สามารถกลับด้าน เพื่อใช้ในการพิมพ์และกดจุดอักษรเบรลล์ได้ เช่น อักษรเบรลล์ เป็น ล์ลรบเรษก ั อ
'''
from pybraille import braille
class thaibraille():
	def word(self,data):
		self.word=data # รับข้อความเข้ามาในระบบ
		self.data =[]
	def tobraille(self):
		self.dict1={"ก":['1234'],"ข":['15'],"ฃ":['456','15'],"ค":['156'],"ฅ":['56','156'],"ฆ":['6','156'],"ง":['12346'],'จ':['234'],'ฉ':['25'],'ช':['256'],'ซ':['2356'],'ฌ':['6','256'],'ญ':['6','12456'],'ฎ':['6','124'],'ฏ':['6','1346'],'ฐ':['6','2345'],'ฑ':['6','23456'],'ฒ':['56','23456'],'ณ':['6','1245'],'ด':['124'],'ต':['1346'],'ถ':['2345'],'ท':['23456'],'ธ':['456','23456'],'น':['1245'],'บ':['1356'],'ป':['12356'],'ผ':['1235'],'ฝ':['1256'],'พ':['1246'],'ฟ':['1236'],'ภ':['6','1246'],'ม':['125'],'ย':['12456'],'ร':['1345'],'ล':['135'],'ว':['2346'],'ศ':['6','235'],'ษ':['56','235'],'ส':['235'],'ห':['134'],'ฬ':['6','135'],'อ':['145'],'ฮ':['123456'],'1':['1'],'2':['13'],'3':['12'],'4':['124'],'5':['14'],'6':['123'],'7':['1234'],'8':['134'],'9':['23'],'0':['234']} # เก็บพยัญชนะและตัวเลข
		for a in list(self.word):
			self.braille = braille(self.dict1[a])
			self.data.append(self.braille.tobraille())
			self.data.append(" ")
		return ''.join(self.data)